void wait1(int);
void wait10(int);
/*-----------------------------------------*/
/*短いウエートルーチン                       */
/*-----------------------------------------*/
void wait1(int t)
{
	int i;
	for(i=0;i<=t;i++);
	return;
}
/*---------------------------------------*/
/*長いウエートルチーン                    */
/*--------------------------------------*/
void wait10(int t)
{
	int i;
	for(i=0;i<=t;i++){wait1(3070);}
	return;
}
///////////////////////////////////////////////////////////
//光電センサ
//////////////////////////////////////////////////////////
unsigned char kou_in(void) /*kou_in()という関数を作る*/
{
    unsigned char i;	/*符号無し８ビットサイズで変数iを宣言*/
    i = P2.DR.BYTE;		/*PAから１Byte（１BYTE=8BIT)サイズで取りこむ*/
    return(i);			/*iの値を（メインに）戻す*/
}
/*-----------------------------------------------------------*/
/* ディッブスイッチの値を入力する。                          */
/*-----------------------------------------------------------*/
unsigned char dip_in(void) /*dip_in()という関数を作る*/
{
    unsigned char i;	/*符号無し８ビットサイズで変数iを宣言*/
    i=P4.DR.BYTE;		/*PAから１Byte（１BYTE=8BIT)サイズで取りこむ*/
    i=~( i >> 4 );				/*iの値を２進反転しiに戻す*/
    i=0x03 & i;			/*下位４ビット以外を切り捨てる*/
    return(i);			/*iの値を（インに）戻す*/
}